{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 929], "dtype": "float32", "sparse": false, "name": "input"}, "inbound_nodes": []}, {"name": "input-reshape", "class_name": "Reshape", "config": {"name": "input-reshape", "trainable": true, "target_shape": [929, 1, 1]}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "conv1", "class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "filters": 256, "kernel_size": [32, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input-reshape", 0, 0, {}]]]}, {"name": "conv1-maxpool", "class_name": "MaxPooling2D", "config": {"name": "conv1-maxpool", "trainable": true, "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "conv1-BN", "class_name": "BatchNormalization", "config": {"name": "conv1-BN", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1-maxpool", 0, 0, {}]]]}, {"name": "conv2", "class_name": "Conv2D", "config": {"name": "conv2", "trainable": true, "filters": 32, "kernel_size": [64, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1-BN", 0, 0, {}]]]}, {"name": "conv2-maxpool", "class_name": "MaxPooling2D", "config": {"name": "conv2-maxpool", "trainable": true, "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}, "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"name": "conv2-BN", "class_name": "BatchNormalization", "config": {"name": "conv2-BN", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2-maxpool", 0, 0, {}]]]}, {"name": "conv3", "class_name": "Conv2D", "config": {"name": "conv3", "trainable": true, "filters": 128, "kernel_size": [64, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2-BN", 0, 0, {}]]]}, {"name": "conv3-BN", "class_name": "BatchNormalization", "config": {"name": "conv3-BN", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3", 0, 0, {}]]]}, {"name": "conv4", "class_name": "Conv2D", "config": {"name": "conv4", "trainable": true, "filters": 256, "kernel_size": [64, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3-BN", 0, 0, {}]]]}, {"name": "conv4-BN", "class_name": "BatchNormalization", "config": {"name": "conv4-BN", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4", 0, 0, {}]]]}, {"name": "conv5", "class_name": "Conv2D", "config": {"name": "conv5", "trainable": true, "filters": 512, "kernel_size": [64, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv4-BN", 0, 0, {}]]]}, {"name": "conv5-BN", "class_name": "BatchNormalization", "config": {"name": "conv5-BN", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv5", 0, 0, {}]]]}, {"name": "classifier", "class_name": "Conv2D", "config": {"name": "classifier", "trainable": true, "filters": 486, "kernel_size": [4, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv5-BN", 0, 0, {}]]]}, {"name": "transpose", "class_name": "Permute", "config": {"name": "transpose", "trainable": true, "dims": [2, 1, 3]}, "inbound_nodes": [[["classifier", 0, 0, {}]]]}, {"name": "flatten", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["transpose", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["flatten", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}